# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'

# Development
# Skip everything except node as most dev tools will
# run in a VM dev environment - docker, vagrant, etc.
# brew 'php'
# brew 'imagick'
# brew 'mysql'
# brew 'nginx'
# brew 'redis'
brew 'node'

# Apps
cask 'adobe-acrobat-reader'
cask 'aerial'
cask 'alfred'
cask 'authy'
cask 'bitbar'
cask 'choosy'
cask 'daisydisk'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'fontforge'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'imagealpha'
cask 'imageoptim'
cask 'iterm2'
cask 'karabiner-elements'
cask 'kindle'
cask 'logitech-options'
cask 'macdown'
cask 'microsoft-word'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-teams'
cask 'private-internet-access'
cask 'qbittorrent'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'stay'
cask 'teamviewer'
cask 'the-unarchiver'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'webex'
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
brew 'svn'
cask 'font-lato'
cask 'font-fira-code'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Gapplin', id: 768053424
